const app = Vue.createApp({

    data() {
        return {
            index: 0,
            product: [
                {
                    id: 1,
                    name: "薑汁燒肉",
                    img: "./images/box-info/box-info-ginger.jpg",
                    cuisine: "日式料理",
                    price: "188",
                    time: "20分鐘",
                    tool: "平底鍋",
                    intro: "薑燒豬肉是一道傳統的日本料理，結合了豬肉的香嫩與薑汁的辛香，是一道美味又營養的料理。這道菜色香味俱全，適合當作家庭晚餐或宴客招待的佳餚。現在就讓我們來學習如何製作這道美味的薑燒",
                    ingredients: [
                        { item: "豬肉(建議使用豬里肌肉或肩肉，切成薄片)", num: "500g" },
                        { item: "醬油", num: "3匙" },
                        { item: "日本料理酒(或米酒)", num: "3匙" },
                        { item: "大蒜（切成末狀）", num: "1顆" },
                        { item: "洋蔥（切成薄片）", num: "1顆" },
                        { item: "蔥花(裝飾用)", num: "適量" },
                        { item: "薑汁(將薑切成細絲，擠壓出汁液)", num: "2匙" }

                    ],
                    steps: [
                        { id: 1, title: "準備豬肉", do: "將豬肉洗淨，用廚房紙巾擦乾，然後將豬肉切成薄片，厚度約為3到5毫米，備用。" },
                        { id: 2, title: "調製薑燒醬汁", do: "在一個碗中，將醬油、日本料酒、薑汁、糖和蜂蜜混合在一起，攪拌均勻，成為薑燒醬汁。" },
                        { id: 3, title: "燒烤豬肉", do: "將平底鍋加熱，倒入沙拉油，待油熱後，將豬肉片逐一鋪在平底鍋中，煎至兩面呈金黃色。取出煎好的豬肉，備用。" },
                        { id: 4, title: "炒香蔬菜", do: "在同一平底鍋中加入切好的蒜末、洋蔥片、紅甜椒和綠甜椒，用中火炒熟，直至蔬菜變軟。" },
                        { id: 5, title: "拌炒豬肉與蔬菜", do: "將煎好的豬肉加回平底鍋中，將薑燒醬汁均勻地淋在豬肉和蔬菜上，用中火拌炒至醬汁均勻地附著在食材表面，並將火力調至小火燜煮約2-3分鐘，讓豬肉充分吸收薑燒醬汁的味道。" },
                        { id: 6, title: "裝盤與裝飾", do: "將薑燒豬肉盛盤，撒上適量蔥花作為裝飾。你的美味薑燒豬肉現在已經完成，趕快享用吧！" }
                    ],
                    tip1: "可以根據個人口味增減糖和蜂蜜的份量，調整甜度。",
                    tip2: "薑燒豬肉應盡快食用，以免過度燉煮影響肉質口感。",
                    tip3: "若喜歡更多蔬菜，可以增加其他蔬菜種類如胡蘿蔔或香菇。",
                    chefName: "橫山一郎",
                    chefIntro: "橫山一郎是一位熱愛料理的資深日本料理大廚，擁有超過25年的廚藝經驗。他在年輕時就對料理產生濃厚的興趣，經過多年的學習與精進，成為了日本料理界的翹楚。橫山一郎對於傳統的日本料理深具造詣，同時也敢於嘗試創新，將傳統料理元素與現代烹飪技巧巧妙結合。",
                    chefImg: "./images/box-info/box-info-chef1.png"


                },
                {
                    id: 2,
                    name: "蟹肉棒壽司捲",
                    img: "./images/box-info/box-info-sushi.jpg",
                    cuisine: "日式料理",
                    price: "166",
                    time: "30分鐘",
                    tool: "壽司捲蓆",
                    intro: "這道壽司捲融合了海鮮的鮮美和壽司的美味，將新鮮的蟹肉棒與其他精心挑選的配料結合在一起，呈現出精緻的外觀和豐富的口感，適合作為精緻的小吃或聚會上的一道亮點。",
                    ingredients: [
                        { item: "壽司米", num: "300g" },
                        { item: "蟹肉棒", num: "4-6支" },
                        { item: "青瓜", num: "1根" },
                        { item: "胡蘿蔔", num: "1根" },
                        { item: "酥炸蔥絲", num: "適量" },
                        { item: "壽司醋", num: "2匙" },
                        { item: "海苔", num: "1張" }



                    ],
                    steps: [
                        { id: 1, title: "預備壽司米", do: "將壽司米煮熟，並在煮飯時加入壽司醋，攪拌均勻。讓飯稍微冷卻，備用。" },
                        { id: 2, title: "準備材料", do: "將蟹肉棒、青瓜、胡蘿蔔等切成細長條，備用。" },
                        { id: 3, title: "包裝壽司", do: "在壽司席上鋪上一片海苔，然後在海苔上均勻地鋪上一層壽司米，留下上方約1英寸的空白。" },
                        { id: 4, title: "放置內餡", do: "在壽司米的中間，放上蟹肉棒、青瓜和胡蘿蔔條。您可以根據喜好加入其他配料。" },
                        { id: 5, title: "捲壽司", do: "輕輕抓住壽司席的下方，開始卷起海苔和內餡，形成壽司卷。確保用適度的壓力讓壽司緊實捲起。" },
                        { id: 6, title: "切片", do: "使用鋒利的壽司刀，將壽司捲切成均勻的小片，每片約1-1.5英寸寬。" },
                        { id: 7, title: "裝盤和裝飾", do: "將切好的壽司片整齊地排在盤子上，可以撒上一些酥炸蔥絲作為裝飾。" }
                    ],
                    tip1: "壽司米在鋪在海苔上時要稍微濕潤，這有助於讓壽司捲更容易捲起並保持形狀。",
                    tip2: "在放置內餡時，避免過度填充，以免壽司捲無法緊實捲起。",
                    tip3: "切割壽司捲時，可以先沾一些水在刀上，這樣可以防止米飯和海苔粘在刀刃上。",
                    chefName: "橫山一郎",
                    chefIntro: "橫山一郎是一位熱愛料理的資深日本料理大廚，擁有超過25年的廚藝經驗。他在年輕時就對料理產生濃厚的興趣，經過多年的學習與精進，成為了日本料理界的翹楚。橫山一郎對於傳統的日本料理深具造詣，同時也敢於嘗試創新，將傳統料理元素與現代烹飪技巧巧妙結合。",
                    chefImg: "./images/box-info/box-info-chef1.png"


                },
                {
                    id: 3,
                    name: "夏日野薺盛宴",
                    img: "./images/box-info/box-info-salad.jpg",
                    cuisine: "西式料理",
                    price: "200",
                    time: "20分鐘",
                    tool: "平底鍋",
                    intro: "充滿自然的原始風味和健康的營養的清新沙拉，這道沙拉將新鮮的野薺與多種時令蔬菜、堅果和香草相結合，為您帶來一份美味又充滿活力的用餐體驗。",
                    ingredients: [
                        { item: "野薺", num: "200g" },
                        { item: "生菜或其他蔬菜", num: "適量" },
                        { item: "堅果", num: "適量" },
                        { item: "水果", num: "依喜好" },
                        { item: "沙拉醬", num: "適量" },
                        { item: "雞蛋", num: "2顆" }

                    ],
                    steps: [
                        { id: 1, title: "預備野薺和其他配料", do: "將野薺洗净，瀝乾，備用。您可以選擇添加生菜、堅果、水果等其他配料。" },
                        { id: 2, title: "製作太陽蛋", do: "在平底鍋中加熱食用油，將雞蛋打入鍋中，盡量保持蛋黃完整，讓蛋白固化。" },
                        { id: 3, title: "混合配料", do: "在大碗中，將洗净的野薺和其他選擇的配料混合在一起。" },
                        { id: 4, title: "添加沙拉醬", do: "加入適量的沙拉醬，您可以選擇自己喜歡的沙拉醬。" },
                        { id: 5, title: "輕輕攪拌", do: "輕輕攪拌混合沙拉，確保沙拉醬均勻地覆蓋在所有配料上。" },
                        { id: 6, title: "裝盤與裝飾", do: "將沙拉盛裝在盤子中，放上製作好的太陽蛋。" }
                    ],
                    tip1: "除了野薺和太陽蛋，您可以添加其他蔬菜、水果、堅果等，增加沙拉的層次感和風味。",
                    tip2: "在製作太陽蛋時，保持蛋黃完整，可以用小火煎炒，以確保蛋白熟透，蛋黃保持液態。",
                    tip3: "添加沙拉醬時，注意不要過多，以免淹沒了食材的原味。可以選擇混合不同風味的沙拉醬，增添變化。",
                    chefName: "Alex Hamilton",
                    chefIntro: "Alex Hamilton是一位傑出的西式料理男廚師，他以他的創意、專業和熱情在烹飪界引起了廣泛的關注。出生於法國的廚藝世家，亞歷克斯從小就對美食和烹飪技藝產生濃厚的興趣。他善於將新鮮的季節食材和當地的特色結合，呈現出充滿層次感和口感的菜品，總是能給食客帶來驚喜和滿足。",
                    chefImg: "./images/box-info/box-info-chef2.png"
                },
                {
                    id: 4,
                    name: "糖醋排骨",
                    img: "./images/box-info/box-info-pork.jpg",
                    cuisine: "中式料理",
                    price: "150",
                    time: "40分鐘",
                    tool: "平底鍋",
                    intro: "糖醋排骨是一道具有豐富口味和多層次風味的中式料理，融合了甜、酸、咸的調味，以及鮮嫩的排骨肉質，成為中式料理的經典之一。這道菜品以其獨特的糖醋醬汁和綿密多汁的肉質，經常在家庭聚會、餐廳和宴會中出現。",
                    ingredients: [
                        { item: "排骨", num: "500g" },
                        { item: "白醋", num: "2匙" },
                        { item: "白糖", num: "3匙" },
                        { item: "醬油", num: "2匙" },
                        { item: "米酒", num: "1匙" },
                        { item: "薑片", num: "數片" },
                        { item: "蒜瓣", num: "數瓣" }
                    ],
                    steps: [
                        { id: 1, title: "準備排骨", do: "將排骨切成小段，洗净，瀝乾，備用。" },
                        { id: 2, title: "醃製排骨", do: "在一個大碗中，加入料酒和少許鹽，將排骨放入醃製約15分鐘，使排骨更加入味。" },
                        { id: 3, title: "炸煮排骨", do: "在炸鍋中加熱食用油，將醃製過的排骨炸至金黃酥脆，然後撈出瀝乾油分。" },
                        { id: 4, title: "烹煮糖醋醬", do: "將白醋加入焦糖中，然後加入醬油，攪拌均勻，使焦糖和醋充分結合。" },
                        { id: 5, title: "加入排骨", do: "將炸好的排骨加入鍋中，迅速翻炒均勻，使排骨均勻沾上醬汁。" },
                        { id: 6, title: "裝盤與裝飾", do: "將糖醋排骨盛裝在盤子中，撒上一些紅辣椒碎作為裝飾，即可享用。" }
                    ],
                    tip1: "炸排骨時要保持中小火，讓排骨充分變得金黃酥脆。不要過度炸煮，以免肉質過於乾燥。",
                    tip2: "在烹煮焦糖時，要注意掌握好顏色，以免燒焦。焦糖過度熔化成焦糖色即可，不需要太深的顏色。",
                    tip3: "根據口味，您可以調整白醋、醬油、糖等的比例，創造出適合自己喜好的糖醋味道。",
                    chefName: "張文豪",
                    chefIntro: "張文豪在多個知名中式餐廳和飯店的廚房中積累了豐富的烹飪經驗。他對中式料理的烹飪技巧和食材有著深刻的理解，同時又善於將傳統與現代相結合，創造出別具一格的美食。他的烹飪作品不僅味道美味，更帶著他對食物和文化的獨特理解，成為了中式料理界一個備受矚目的男廚師。",
                    chefImg: "./images/box-info/box-info-chef3.png"

                },
                {
                    id: 5,
                    name: "POKE",
                    img:"./images/box-info/box-info-poke.jpg",
                    cuisine: "西式料理",
                    price: "160",
                    time: "20分鐘",
                    tool: "刀具、碗",
                    intro: "POKE是一道美味的夏威夷傳統料理，這種美食以新鮮的海鮮為基礎，將海鮮切成小塊，然後混合各種精心調味的配料，形成一道充滿層次豐富、美味怡人的佳餚。",
                    ingredients: [
                        { item: "生鮮魚肉(如鮪魚、鯛魚等)", num: "300g" },
                        { item: "醬油", num: "2匙" },
                        { item: "蔥", num: "1根" },
                        { item: "鳳梨、酪梨、青木瓜等水果或蔬菜", num: "依喜好" },
                        { item: "芝麻油", num: "1匙" },
                        { item: "海鹽和黑胡椒粉", num: "適量" }
                    ],
                    steps: [
                        { id: 1, title: "準備魚肉", do: "將生鮮的魚肉洗净，去皮骨，然後切成小塊，大小可根據喜好調整。" },
                        { id: 2, title: "調製醬汁", do: "在一個碗中，將醬油和芝麻油混合均勻，成為醬汁。" },
                        { id: 3, title: "混合魚肉和醬汁", do: "將魚肉放入一個深碗中，倒入醬汁，輕輕攪拌混合，確保每塊魚都均勻沾滿醬汁。您可以在魚肉醃漬10-15分鐘，讓其吸收風味。" },
                        { id: 4, title: "烹添加配菜", do: "將加入切碎的蔥和水果或蔬菜，如鳳梨、酪梨、青木瓜等。輕輕拌勻，確保魚肉和配菜均勻分布。" },
                        { id: 5, title: "調味", do: "根據口味，添加少量的海鹽和黑胡椒粉，以調整味道。" },
                        { id: 6, title: "裝盤與裝飾", do: "可以在上面撒上一些芝麻作為裝飾，然後即可享用。" }
                    ],
                    tip1: "如果可能，選擇高品質的生魚，確保它新鮮，無異味。",
                    tip2: "您可以根據自己的口味和季節使用不同的水果、蔬菜和調味料。嘗試不同的組合，創造出獨特的風味。",
                    tip3: "在處理生魚時，請確保使用乾净的刀具和工作區，以避免交叉污染。同時，確保魚肉在醃漬過程中保持在安全的溫度下，以避免食品中毒風險。",
                    chefName: "Alex Hamilton",
                    chefIntro: "Alex Hamilton是一位傑出的西式料理男廚師，他以他的創意、專業和熱情在烹飪界引起了廣泛的關注。出生於法國的廚藝世家，亞歷克斯從小就對美食和烹飪技藝產生濃厚的興趣。他善於將新鮮的季節食材和當地的特色結合，呈現出充滿層次感和口感的菜品，總是能給食客帶來驚喜和滿足。",
                    chefImg: "./images/box-info/box-info-chef2.png"

                },
                {
                    id: 6,
                    name: "火腿漢堡",
                    img: "./images/box-info/box-info-hamburger.jpg",
                    color: "green",
                    cuisine: "西式料理",
                    health: false,
                    fast: false,
                    price: "160",
                    time: "20分鐘",
                    tool: "平底鍋",
                    intro: "火腿漢堡是一道經典的美食，將豐富多樣的味道結合在一個餐點中。這道料理由美味的火腿肉、蓬鬆的漢堡麵包以及各種口感豐富的配料和醬料組成，給人們帶來美味的快餐體驗。",
                    ingredients: [
                        { item: "火腿肉漢堡肉餡", num: "250g" },
                        { item: "漢堡麵包", num: "兩片" },
                        { item: "生菜", num: "依喜好" },
                        { item: "番茄片", num: "依喜好" },
                        { item: "洋蔥片", num: "依喜好" },
                        { item: "美乃滋、芥末、番茄醬等調味醬", num: "依喜好" }
                    ],
                    steps: [
                        { id: 1, title: "調製漢堡肉餡", do: "將火腿肉漢堡肉餡用適當的調味，如鹽、胡椒粉、洋蔥粉等，調味均勻。分割和塑造肉餡成您想要的大小和形狀，通常是漢堡的大小。" },
                        { id: 2, title: "預熱平底鍋或燒烤爐", do: "如果使用平底鍋，預熱鍋子，加熱時可以在鍋底刷上一點橄欖油或牛油，避免肉粘在鍋上。如果使用燒烤爐，預熱燒烤爐至中高溫。" },
                        { id: 3, title: "烹飪漢堡肉", do: "將調好味的漢堡肉餡放入預熱的平底鍋或燒烤爐上，用中高火煮熟。根據肉餡的厚度，每面大約烹飪3-5分鐘，或直到內部完全熟透（內部溫度達到165°F / 74°C）。翻轉漢堡肉一次，確保兩面均均勻煎烤。" },
                        { id: 4, title: "準備漢堡麵包和配菜", do: "在漢堡麵包的底部塗抹您喜歡的調味醬，例如美乃滋、芥末、番茄醬等。然後放上生菜、番茄片、洋蔥片等配菜。" },
                        { id: 5, title: "組裝漢堡", do: "將煮熟的漢堡肉放在配菜上，然後蓋上麵包的上半部。您的火腿漢堡就準備好了！" }
                    ],
                    tip1: "選擇新鮮的火腿肉餡，最好是肉質較為緊實，且沒有太多多餘的脂肪，因為它將直接影響到漢堡的口感和味道。",
                    tip2: "在調製和塑造漢堡肉餡時，盡量避免過度揉捏或處理。過度處理肉餡可能導致漢堡變得過於緻密，影響口感。",
                    tip3: "火腿漢堡肉餡通常相對較薄，所以在烹飪時要注意不要過熟，以免變得乾燥。",
                    chefName: "Alex Hamilton",
                    chefIntro: "Alex Hamilton是一位傑出的西式料理男廚師，他以他的創意、專業和熱情在烹飪界引起了廣泛的關注。出生於法國的廚藝世家，亞歷克斯從小就對美食和烹飪技藝產生濃厚的興趣。他善於將新鮮的季節食材和當地的特色結合，呈現出充滿層次感和口感的菜品，總是能給食客帶來驚喜和滿足。",
                    chefImg: "./images/box-info/box-info-chef2.png"

                },
                {
                    id: 7,
                    name: "韭菜豬肉水餃",
                    img: "./images/box-info/box-info-dumpling.jpg",
                    cuisine: "中式料理",
                    price: "120",
                    time: "40分鐘",
                    tool: "鍋子",
                    intro: "將新鮮的韭菜和多汁的豬肉結合在一起，確保每一口都充滿了鮮美和溫暖，這是一道適合與親朋好友共享的佳餚，不論是在午餐時間品味還是晚餐時與家人共享，我們的韭菜豬肉水餃都將成為您的味蕾最愛。",
                    ingredients: [
                        { item: "韭菜", num: "200g" },
                        { item: "豬絞肉", num: "200g" },
                        { item: "水餃皮", num: "20片" },
                        { item: "薑蒜末", num: "依喜好" },
                        { item: "醬油", num: "2匙" },
                        { item: "鹽", num: "適量" },
                        { item: "香油", num: "1茶匙" }

                    ],
                    steps: [
                        { id: 1, title: "預備材料", do: "將韭菜切碎，將薑蒜剁成末，備用。" },
                        { id: 2, title: "調製餡料", do: "在一個大碗中，將豬絞肉和切碎的韭菜放在一起。加入薑蒜末、醬油、花椒粉、鹽和香油，混合均勻。這就是水餃的餡料。" },
                        { id: 3, title: "包水餃", do: "取一片水餃皮，放一些餡料在中間。用指尖蘸些水沿著水餃皮的邊緣，然後將皮對摺成半圓形。用手指輕壓餃邊，使其密封。根據需要，可以摺出花紋或將餃子封口。" },
                        { id: 4, title: "煮水餃", do: " 在大鍋中加入足夠的水，讓水煮沸。將水餃放入滾水中，煮至餃子浮起並變形，這通常需要2-3分鐘。然後再繼續煮1-2分鐘，確保餃子熟透。" },
                        { id: 5, title: "撈出水餃", do: "使用網漏或湯勺，將煮熟的水餃撈出，瀝乾水分。" },
                        { id: 6, title: "擺盤上桌", do: "將煮好的韭菜豬肉水餃裝盤，可以在碟邊放上一碟醋和辣椒油，用來蘸餃子。" },

                    ],
                    tip1: "餃子皮的質地和厚度會影響水餃的口感。選擇適合包餃子的餃皮。",
                    tip2: "如果餡料過於乾燥，包水餃時容易封口不牢。您可以在餡料中加入少許水，保持餡料的濕潤度。",
                    tip3: "包水餃時，不要過度填入餡料，以免餃子爆開煮熟時。適度的餡料量可以確保餃子在烹飪過程中不會爆裂。",
                    chefName: "張文豪",
                    chefIntro: "張文豪在多個知名中式餐廳和飯店的廚房中積累了豐富的烹飪經驗。他對中式料理的烹飪技巧和食材有著深刻的理解，同時又善於將傳統與現代相結合，創造出別具一格的美食。他的烹飪作品不僅味道美味，更帶著他對食物和文化的獨特理解，成為了中式料理界一個備受矚目的男廚師。",
                    chefImg: "./images/box-info/box-info-chef3.png"

                },
                {
                    id: 8,
                    name: "牛肉丼飯",
                    img: "./images/box-info/box-info-donburi.jpg",
                    color: "blue",
                    cuisine: "日式料理",
                    price: "200",
                    time: "35分鐘",
                    tool: "平底鍋",
                    intro: "這道簡單而美味的料理是日本料理的經典之一，以薄切的嫩牛肉、甜美的醬汁和蓬鬆的白飯為特色。每一口都是一次美味的冒險，牛肉的鮮嫩和醬汁的深邃味道在嘴裡融化，帶給您滿滿的滿足感。",
                    ingredients: [
                        { item: "牛肉", num: "200g" },
                        { item: "洋蔥", num: "1顆" },
                        { item: "薑蒜末", num: "依喜好" },
                        { item: "醬油", num: "3匙" },
                        { item: "糖", num: "1.5匙" },
                        { item: "酒", num: "2匙" },
                        { item: "高湯或水", num: "半杯" },
                        { item: "雞蛋", num: "1顆" },
                        { item: "蔥花", num: "適量" },
                        { item: "白飯", num: "適量" },

                    ],
                    steps: [
                        { id: 1, title: "預備材料", do: "將牛肉切成薄片或小塊，洋蔥切成薄片，打散雞蛋，備用。" },
                        { id: 2, title: "炒煮備料", do: "在鍋中加熱一些食用油，加入洋蔥和薑蒜末炒煮片刻，直至洋蔥變軟。" },
                        { id: 3, title: "加入牛肉", do: "將切好的牛肉加入鍋中，繼續翻炒至牛肉變色，變得稍微熟透。" },
                        { id: 4, title: "調味", do: "加入醬油、糖和酒，攪拌均勻，使調味料充分滲透到牛肉和洋蔥中。" },
                        { id: 5, title: "加入高湯或水", do: " 倒入高湯或水，使調味料和牛肉充分混合。將火調至中小火，繼續燉煮幾分鐘，使牛肉入味，洋蔥變軟。" },
                        { id: 6, title: "加入雞蛋（選擇性）", do: "如果喜歡，您可以將打散的雞蛋倒入鍋中，攪拌均勻，讓蛋液在牛肉和洋蔥間凝固。" },
                        { id: 7, title: "裝盤", do: "將煮好的牛肉和洋蔥混合物盛裝在煮好的白飯上，撒上一些蔥花作為裝飾。" }

                    ],
                    tip1: "您可以使用薄片的牛肉或小塊的牛肉。根據您的口味和喜好選擇適合的牛肉。",
                    tip2: "調味料的份量可以根據您的喜好進行微調，如果您喜歡更甜或更鹹的口味，可以適當增加糖或醬油的量。",
                    tip3: "在炒煮洋蔥時，可以用中小火進行，讓洋蔥變得軟嫩並散發出甜味。",
                    chefName: "橫山一郎",
                    chefIntro: "橫山一郎是一位熱愛料理的資深日本料理大廚，擁有超過25年的廚藝經驗。他在年輕時就對料理產生濃厚的興趣，經過多年的學習與精進，成為了日本料理界的翹楚。橫山一郎對於傳統的日本料理深具造詣，同時也敢於嘗試創新，將傳統料理元素與現代烹飪技巧巧妙結合。",
                    chefImg: "./images/box-info/box-info-chef1.png"


                },
                {
                    id: 9,
                    name: "牛肉咖哩",
                    img: "./images/box-info/box-info-curry.jpg",
                    color: "blue",
                    cuisine: "日式料理",
                    price: "250",
                    time: "40分鐘",
                    tool: "燉煮鍋",
                    intro: "這是一道結合了濃郁咖哩風味和嫩滑牛肉的令人垂涎的料理。我們的廚師以獨特的秘方調製咖哩醬汁，經過緩慢的烹煮，讓香料的風味深度融入每一口。牛肉則被精心烹調至極致的嫩軟，與咖哩的濃郁相得益彰。",
                    ingredients: [
                        { item: "牛肉", num: "300g" },
                        { item: "馬鈴薯", num: "2顆" },
                        { item: "胡蘿蔔", num: "2根" },
                        { item: "洋蔥", num: "1顆" },
                        { item: "咖哩塊", num: "2塊" },
                        { item: "椰漿", num: "1/2杯" },
                        { item: "高湯或水", num: "2杯" },
                        { item: "白飯", num: "依喜好" },
                        

                    ],
                    steps: [
                        { id: 1, title: "預備材料", do: "將牛肉、馬鈴薯、胡蘿蔔和洋蔥切成適當大小的塊，備用。" },
                        { id: 2, title: "煮炒牛肉", do: "在炒鍋中加熱食用油，將牛肉塊炒至稍微變色，然後撈出備用。" },
                        { id: 3, title: "炒煮蔬菜", do: "在同一個鍋中，加入更多的食用油，將洋蔥、胡蘿蔔和馬鈴薯塊炒煮幾分鐘，使它們稍微變軟。" },
                        { id: 4, title: "加入咖哩塊", do: "將咖哩塊加入炒煮的蔬菜中，快速翻炒均勻，使咖哩塊開始融化。" },
                        { id: 5, title: "加入椰漿和高湯", do: "慢慢倒入椰漿和高湯，攪拌均勻，使咖哩塊完全融入液體中。" },
                        { id: 6, title: "燉煮牛肉咖哩", do: "將之前炒煮好的牛肉放回鍋中，繼續用中小火燉煮。蓋上鍋蓋，讓牛肉和蔬菜緩慢燉煮，直到它們變得軟嫩" },
                        { id: 7, title: "調味和組合", do: "當牛肉和蔬菜變得軟嫩時，可以根據需要加入一些鹽和胡椒粉，調整味道。將牛肉咖哩淋在煮好的白飯上。" }

                    ],
                    tip1: "咖哩塊的種類和品牌不同，風味和辣度也會有所不同。您可以根據自己的喜好選擇適合的咖哩塊。",
                    tip2: "可以使用慢火或中小火進行燉煮，保持牛肉的質地。",
                    tip3: "如果您喜歡，您可以在咖哩中加入其他蔬菜，如青豆或玉米。",
                    chefName: "橫山一郎",
                    chefIntro: "橫山一郎是一位熱愛料理的資深日本料理大廚，擁有超過25年的廚藝經驗。他在年輕時就對料理產生濃厚的興趣，經過多年的學習與精進，成為了日本料理界的翹楚。橫山一郎對於傳統的日本料理深具造詣，同時也敢於嘗試創新，將傳統料理元素與現代烹飪技巧巧妙結合。",
                    chefImg: "./images/box-info/box-info-chef1.png"

                },
                {
                    id: 10,
                    name: "麻婆豆腐",
                    img: "./images/box-info/box-info-tofu.jpg",
                    cuisine: "中式料理",
                    price: "150",
                    time: "30分鐘",
                    tool: "深底鍋",
                    intro: "這道料理擁有令人難以抗拒的風味，充滿了辛辣和麻辣的滋味，麻婆豆腐的湯汁充滿了層次感，兼具香、辣和麻的風味以及嫩滑的豆腐質地，軟嫩的豆腐與醬汁完美融合，每一口都是一次令人愉悅的體驗。",
                    ingredients: [
                        { item: "嫩豆腐", num: "300g" },
                        { item: "味噌豆瓣醬", num: "2匙" },
                        { item: "辣豆瓣醬", num: "1匙" },
                        { item: "豬絞肉", num: "100g" },
                        { item: "蔥", num: "1根" },
                        { item: "薑蒜末", num: "適量" },
                        { item: "鹽和醬油", num: "適量" }

                    ],
                    steps: [
                        { id: 1, title: "預備材料", do: "將嫩豆腐切塊，將蔥切碎，備用。如有需要，將薑蒜剁成末。" },
                        { id: 2, title: "炒煮豬絞肉", do: "在鍋中加熱食用油，加入豬絞肉炒煮至熟透，並變成鬆散的肉碎。如果使用牛肉或雞肉，同樣將其炒煮至熟透。" },
                        { id: 3, title: "加入味噌和辣豆瓣醬", do: "在炒煮的肉中，加入味噌豆瓣醬和辣豆瓣醬，快速翻炒均勻，使調味料均勻分布。" },
                        { id: 4, title: "加入蔥和薑蒜", do: "如果使用薑蒜，加入薑蒜末翻炒片刻，然後加入切碎的蔥，繼續翻炒均勻。" },
                        { id: 5, title: "加入豆腐", do: "將切塊的嫩豆腐加入鍋中，輕輕攪拌，使豆腐與調味料充分結合。避免過度攪拌，以免豆腐碎裂。" },
                        { id: 6, title: "烹飪至豆腐入味", do: "繼續烹飪幾分鐘，讓豆腐吸收調味料的風味，使其入味。" },
                        { id: 7, title: "調味和裝飾", do:"根據口味，可以根據需要添加一些鹽和醬油進一步調味，然後即可享用。"},

                    ],
                    tip1: "辣豆瓣醬的辣度因品牌而異，根據個人的辣度喜好調整使用的量。",
                    tip2: "嫩豆腐通常更適合做麻婆豆腐，因為它較不易碎裂。您可以根據自己的喜好選擇硬度。",
                    tip3: "在加入嫩豆腐後，要輕輕攪拌以免豆腐碎裂。同時，避免過度烹飪豆腐，以免它變得過於爛糊。",
                    chefName: "張文豪",
                    chefIntro: "張文豪在多個知名中式餐廳和飯店的廚房中積累了豐富的烹飪經驗。他對中式料理的烹飪技巧和食材有著深刻的理解，同時又善於將傳統與現代相結合，創造出別具一格的美食。他的烹飪作品不僅味道美味，更帶著他對食物和文化的獨特理解，成為了中式料理界一個備受矚目的男廚師。",
                    chefImg: "./images/box-info/box-info-chef3.png"

                },
                {
                    id: 11,
                    name: "玉米濃湯",
                    img: "./images/box-info/box-info-cornsoup.jpg",
                    color: "green",
                    cuisine: "西式料理",
                    price: "100",
                    time: "35分鐘",
                    tool: "深底鍋",
                    intro: "這款湯品不僅是一道美味的前菜，還是溫暖和滿足的滋味來源。玉米濃湯的簡單而美味，是所有年齡層的人喜愛的選擇。它適合於冷冽的冬天暖身，也是在任何季節享用的絕佳選擇。",
                    ingredients: [
                        { item: "罐頭玉米粒", num: "2杯" },
                        { item: "洋蔥", num: "1個" },
                        { item: "鮮奶油或牛奶", num: "1杯" },
                        { item: "雞湯", num: "2杯" },
                        { item: "麵粉", num: "2匙" },
                        { item: "鹽和胡椒粉", num: "適量" }
                    ],
                    steps: [
                        { id: 1, title: "切洋蔥、煮玉米", do: "將洋蔥切碎，備用。將罐頭內的玉米瀝乾。備用。" },
                        { id: 2, title: " 煮洋蔥", do: "在一個大鍋中，炒煮洋蔥，直到洋蔥變軟和透明。" },
                        { id: 3, title: "調製濃湯底", do: "將麵粉撒在煮洋蔥的鍋中，攪拌均勻，繼續烹飪幾分鐘，直至麵粉呈金黃色。" },
                        { id: 4, title: "加入湯底", do: "慢慢倒入雞湯，不斷攪拌，確保沒有結塊。可以選擇添加一些高湯粉來增添湯的鮮味。繼續煮沸並攪拌，直到湯稍微變濃稠。" },
                        { id: 5, title: "加入玉米", do: "將玉米粒加入湯中，繼續煮幾分鐘，使玉米變熟。" },
                        { id: 6, title: "加入奶油或牛奶", do: "將鮮奶油或牛奶加入湯中，攪拌均勻，讓湯變得更加濃郁和滑順。" },
                        { id: 7, title: "調味", do: "根據口味加入適量的鹽和胡椒粉，調味均勻。" },
                    ],
                    tip1: "選擇高質量的罐頭，可以選擇無鹽或低鈉版本，這樣您可以更好地控制調味。",
                    tip2: "在加入奶油或牛奶之前，最好先將湯底和玉米混合均勻，確保玉米已經煮熟且湯的質地濃稠。然後再添加奶油或牛奶，這樣可以確保湯的質地更加順滑",
                    tip3: "若使用攪拌機攪拌能確保湯的質地，還可以充分混合和融合所有的成分，使味道更加均勻。",
                    chefName: "Alex Hamilton",
                    chefIntro: "Alex Hamilton是一位傑出的西式料理男廚師，他以他的創意、專業和熱情在烹飪界引起了廣泛的關注。出生於法國的廚藝世家，亞歷克斯從小就對美食和烹飪技藝產生濃厚的興趣。他善於將新鮮的季節食材和當地的特色結合，呈現出充滿層次感和口感的菜品，總是能給食客帶來驚喜和滿足。",
                    chefImg: "./images/box-info/box-info-chef2.png"

                },
                {
                    id: 12,
                    name: "牛肉漢堡套餐",
                    img: "./images/box-info/box-info-beefhamburger.jpg",
                    color: "green",
                    cuisine: "西式料理",
                    price: "188",
                    time: "45分鐘",
                    tool: "平底鍋",
                    intro: "我們引以為傲的牛肉漢堡以新鮮、優質的牛肉精心製作，每一口都充滿了濃郁的肉汁和風味，適合各種場合，無論是快速午餐、輕鬆晚餐，或是和朋友家人一起享受的時刻。",
                    ingredients: [
                        { item: "牛肉漢堡肉餡", num: "250g" },
                        { item: "漢堡麵包", num: "2個" },
                        { item: "生菜、番茄片、洋蔥片", num: "依喜好" },
                        { item: "薯條", num: "300g" },
                        { item: "鹽和黑胡椒粉", num: "適量" },
                        { item: "調味醬", num: "依喜好" }
                    ],
                    steps: [
                        { id: 1, title: "調製漢堡肉餡", do: "將牛肉漢堡肉餡加入適量的鹽和黑胡椒粉進行調味，然後分割和塑造成您想要的大小和形狀，通常是漢堡的大小。" },
                        { id: 2, title: "預熱平底鍋", do: "預熱鍋子，加熱時可以在鍋底刷上一點橄欖油或牛油，避免肉粘在鍋上。" },
                        { id: 3, title: "烹飪漢堡肉", do: "將調好味的漢堡肉餡放入預熱的平底鍋上，用中高火煮熟。根據肉餡的厚度，每面大約烹飪3-5分鐘，或直到內部完全熟透" },
                        { id: 4, title: "烹飪薯條", do: "準備薯條。將薯條均勻分布在烤盤上，輕輕刷上一些食用油，然後放入已預熱的烤箱中，按照薯條包裝上的指示烹飪" },
                        { id: 5, title: "準備配菜和麵包", do: "在漢堡麵包的底部塗抹您喜歡的調味醬，然後放上生菜、番茄片、洋蔥片等配菜。" },
                        { id: 6, title: "組裝漢堡套餐", do: " 將煮熟的漢堡肉放在配菜上，然後蓋上麵包的上半部。將烹飪好的薯條放在旁邊。" },
                        
                    ],
                    tip1: "翻轉漢堡肉時，只需翻轉一次。過度翻轉可能導致肉餡變得乾燥，影響口感。",
                    tip2: "牛肉漢堡的烹飪時間取決於肉餡的厚度和烹飪方法。使用肉溫計確保內部溫度達到安全溫度。",
                    tip3: "要維持薯條酥脆和金黃的外觀，烹飪時間需小心控制。",
                    chefName: "Alex Hamilton",
                    chefIntro: "Alex Hamilton是一位傑出的西式料理男廚師，他以他的創意、專業和熱情在烹飪界引起了廣泛的關注。出生於法國的廚藝世家，亞歷克斯從小就對美食和烹飪技藝產生濃厚的興趣。他善於將新鮮的季節食材和當地的特色結合，呈現出充滿層次感和口感的菜品，總是能給食客帶來驚喜和滿足。",
                    chefImg: "./images/box-info/box-info-chef2.png"

                },
                {
                    id: 13,
                    name: "酪梨沙拉",
                    img: "./images/box-info/box-info-avocadosalad.jpg",
                    color: "green",
                    cuisine: "西式料理",
                    price: "139",
                    time: "20分鐘",
                    tool: "刀具",
                    intro: "品味新鮮、健康的美食，歡迎來品嚐我們精心製作的酪梨沙拉。這款沙拉是一道融合了多種食材和風味的創意菜品，以酪梨為主要原料，為您帶來了一場令人愉悅的味覺冒險。",
                    ingredients: [
                        { item: "成熟的酪梨", num: "1個" },
                        { item: "番茄", num: "1個" },
                        { item: "洋蔥", num: "1/4個" },
                        { item: "檸檬汁", num: "1顆檸檬量" },
                        { item: "橄欖油", num: "2匙" },
                        { item: "鹽和胡椒粉", num: "適量" }
                    ],
                    steps: [
                        { id: 1, title: "酪梨切塊", do: "將酪梨切成一半，去核，然後使用湯匙將果肉從皮中挖出，切成小塊。" },
                        { id: 2, title: "番茄、洋蔥處理", do: "預將番茄切成小塊，去除種子和多餘的水分。將紅洋蔥切碎。" },
                        { id: 3, title: "混合材料", do: "在一個碗中，將切好的酪梨、番茄和紅洋蔥混合在一起。" },
                        { id: 4, title: "調味", do: "添加檸檬汁、橄欖油、鹽和胡椒粉，根據口味調整調味。" },
                        { id: 5, title: "完成擺盤", do: "輕輕攪拌混合，確保所有配料均勻沾滿調味料即完成" },
                     
                        
                    ],
                    tip1: "選擇熟透的酪梨是製作美味酪梨沙拉的關鍵。",
                    tip2: "酪梨容易氧化變色，使用檸檬汁可以幫助保持鮮綠的顏色。",
                    tip3: "酪梨沙拉可以根據您的口味加入各種額外的配料，例如：切碎的新鮮香草或者一些類似堅果的東西。",
                    chefName: "Alex Hamilton",
                    chefIntro: "Alex Hamilton是一位傑出的西式料理男廚師，他以他的創意、專業和熱情在烹飪界引起了廣泛的關注。出生於法國的廚藝世家，亞歷克斯從小就對美食和烹飪技藝產生濃厚的興趣。他善於將新鮮的季節食材和當地的特色結合，呈現出充滿層次感和口感的菜品，總是能給食客帶來驚喜和滿足。",
                    chefImg: "./images/box-info/box-info-chef2.png"

                },
                {
                    id: 14,
                    name: "炸豬排",
                    img: "./images/box-info/box-info-friedpork.jpg",
                    color: "blue",
                    cuisine: "日式料理",
                    price: "188",
                    time: "40分鐘",
                    tool: "炸鍋",
                    intro: "炸豬排是日式料理中的經典之一，充滿了美食的樂趣和濃厚的美味。通常搭配白飯或沙拉，也可以夾在麵包中做成豬排便當。它是一道簡單卻美味的料理，適合在各種場合享用。",
                    ingredients: [
                        { item: "豬里肌肉", num: "300g" },
                        { item: "麵包糠", num: "1杯" },
                        { item: "麵粉", num: "1/4杯" },
                        { item: "雞蛋", num: "2顆" },
                        { item: "鹽和胡椒粉", num: "適量" },
                      
                        

                    ],
                    steps: [
                        { id: 1, title: "備豬肉", do: "將豬里肌肉切成適當大小的肉排，然後用紙巾輕輕擦乾，使其表面不濕潤。" },
                        { id: 2, title: "調味", do: "在肉排上均勻地撒上鹽和胡椒粉，翻轉並重複這個步驟。" },
                        { id: 3, title: "三步曲", do: "製作三個碗，分別裝有麵粉、打散的雞蛋和麵包糠。" },
                        { id: 4, title: "裹麵粉", do: "將每片豬排在麵粉中均勻地裹上一層麵粉。" },
                        { id: 5, title: "浸泡雞蛋", do: "將麵粉裹好的豬排浸入打散的雞蛋中，確保每一側都均勻沾滿蛋液。" },
                        { id: 6, title: "包上麵包糠", do: "最後，將濕潤的豬排放入麵包糠中，確保外表均勻地包上麵包糠。" },
                        { id: 7, title: "炸豬排", do: "輕輕地將豬排放入油中，小心不要過度擁擠鍋子。炸約2-3分鐘，或直到豬排外皮變得金黃酥脆，內部熟透。" },
                        { id: 8, title: "上桌享用", do: "炸豬排通常伴隨著白飯，形成一道美味的定食。" },


                    ],
                    tip1: "選擇較瘦的豬肉部位，因為它們的脂肪較少，能夠避免炸出過分油膩的口感。",
                    tip2: "準備一個溫度計以確保食用油達到約180°C的溫度。這個溫度對於炸豬排來說是理想的，可以確保外皮酥脆，內部完全熟透。",
                    tip3: "不要過度擁擠鍋子。每次炸煮的數量應該剛好覆蓋鍋底，以確保油的溫度保持穩定。",
                    chefName: "橫山一郎",
                    chefIntro: "橫山一郎是一位熱愛料理的資深日本料理大廚，擁有超過25年的廚藝經驗。他在年輕時就對料理產生濃厚的興趣，經過多年的學習與精進，成為了日本料理界的翹楚。橫山一郎對於傳統的日本料理深具造詣，同時也敢於嘗試創新，將傳統料理元素與現代烹飪技巧巧妙結合。",
                    chefImg: "./images/box-info/box-info-chef1.png"

                },
                {
                    id: 15,
                    name: "豚骨拉麵",
                    img: "./images/box-info/box-info-ramen.jpg",
                    color: "blue",
                    cuisine: "日式料理",
                    price: "200",
                    time: "40分鐘",
                    tool: "燉煮鍋",
                    intro: "這是一道充滿濃厚風味的日本拉麵，以精選的豬骨高湯為基礎經過長時間的慢燉而成，保留了豬骨的鮮美和濃厚，再加入細面條、烤豬肉叉燒和各種美味配料，呈現出一碗令人陶醉的美食佳餚。",
                    ingredients: [
                        { item: "臀骨", num: "3-4磅" },
                        { item: "洋蔥", num: "1顆" },
                        { item: "蔥薑蒜末", num: "適量" },
                        { item: "昆布", num: "2片" },
                        { item: "鹽", num: "適量" },
                        { item: "拉麵", num: "1份" },
                        { item: "燒豬肉片", num: "3片" },
                        { item: "溫泉蛋", num: "1顆" },
                      
                        

                    ],
                    steps: [
                        { id: 1, title: "燉煮豚骨湯底", do: "在大湯鍋中，加入豚骨骨頭，然後加足夠的水，讓水覆蓋骨頭。將骨頭帶至沸騰，然後撇去浮渣。" },
                        { id: 2, title: "加入備料", do: "加入洋蔥、大蒜、生薑和昆布。降低火力，讓湯慢慢燉煮，以便提取風味。" },
                        { id: 3, title: "過濾湯底", do: "使用濾網或細篩過濾湯底，以去除固體食材。將湯底返回鍋中，保持溫暖，以便稍後使用。" },
                        { id: 4, title: "烹煮拉麵", do: "拉麵應該煮至剛剛變軟，然後過濾並沖洗以去除多餘的澱粉。" },
                        { id: 5, title: "調味湯底", do: "在湯底中加入醬油，以增添風味，並根據需要添加鹽。" },
                        { id: 6, title: "組合豚骨拉麵", do: "在每碗中放入烹煮好的拉麵，然後倒入熱湯底。加入燒豬肉片、蔥和溫泉蛋作為配料。" },
                       
                    ],
                    tip1: "湯底的燉煮時間越長，湯底越濃郁。儘量燉煮長一些時間，以確保豚骨風味充分提取。",
                    tip2: "如果您的豚骨骨頭較新鮮，可以考慮將它們浸泡在水中約1-2小時，並在開始燉煮之前排空浸泡的水，這有助於去除血液和雜質。",
                    tip3: "在調味湯底時請小心，因為醬油已經很咸。逐漸添加，以達到您所喜好的味道。",
                    chefName: "橫山一郎",
                    chefIntro: "橫山一郎是一位熱愛料理的資深日本料理大廚，擁有超過25年的廚藝經驗。他在年輕時就對料理產生濃厚的興趣，經過多年的學習與精進，成為了日本料理界的翹楚。橫山一郎對於傳統的日本料理深具造詣，同時也敢於嘗試創新，將傳統料理元素與現代烹飪技巧巧妙結合。",
                    chefImg: "./images/box-info/box-info-chef1.png"

                },
                {
                    id: 16,
                    name: "鯛魚燒",
                    img: "./images/box-info/box-info-taiyaki.jpg",
                    color: "blue",
                    cuisine: "日式料理",
                    price: "200",
                    time: "35分鐘",
                    tool: "平底鍋",
                    intro: "歡迎品味我們的美味鯛魚燒，這是一種日本傳統的點心，以其獨特的外形和美味的內餡而聞名。無論是作為下午茶的小點心，還是作為特殊場合的美味享受，我們的鯛魚燒都能為您帶來甜蜜的時刻。",
                    ingredients: [
                        { item: "低筋麵粉", num: "1杯" },
                        { item: "砂糖", num: "1/4杯"},
                        { item: "雞蛋", num: "2顆" },
                        { item: "牛奶", num: "1/2杯" },
                        { item: "植物油", num: "1/4杯" },
                        { item: "紅豆泥", num: "300g" },
                       
                      
                        

                    ],
                    steps: [
                        { id: 1, title: "準備麵糊", do: "在一個大碗中，將低筋麵粉和砂糖混合在一起。" },
                        { id: 2, title: "添加蛋和牛奶", do: "將大蛋打入麵糊中，然後加入牛奶。攪拌均勻，直到成為光滑的麵糊。" },
                        { id: 3, title: "加入植物油", do: "慢慢地加入植物油，然後再次攪拌均勻，確保油完全融入麵糊中。" },
                        { id: 4, title: "烹煮麵糊", do: "將一個平底鍋預熱至中火，不需要加油。倒入一勺麵糊，蓋住鍋底，烹煮約2分鐘，或直到底部變成金黃色。" },
                        { id: 5, title: "加入內餡", do: "翻轉煎餅，然後在一邊上放入一小勺紅豆泥" },
                        { id: 6, title: "包裝鯛魚燒", do: "將煎餅的另一邊蓋在內餡上，用手指或餅鏟緊壓邊緣，形成魚形。" },
                       
                    ],
                    tip1: "可以在麵糊中添加一些香草提取物或檸檬皮屑等調味劑，以增添風味。",
                    tip2: "如果你是第一次製作鯛魚燒，可以練習一兩次以熟練掌握技巧，確保外皮均勻且內餡不漏。",
                    tip3: "讓鯛魚燒稍微冷卻幾分鐘，這樣內餡不會太熱，你可以安全地品嚐。",
                    chefName: "橫山一郎",
                    chefIntro: "橫山一郎是一位熱愛料理的資深日本料理大廚，擁有超過25年的廚藝經驗。他在年輕時就對料理產生濃厚的興趣，經過多年的學習與精進，成為了日本料理界的翹楚。橫山一郎對於傳統的日本料理深具造詣，同時也敢於嘗試創新，將傳統料理元素與現代烹飪技巧巧妙結合。",
                    chefImg: "./images/box-info/box-info-chef1.png"

                },
                {
                    id: 17,
                    name: "炸蝦天婦羅",
                    img: "./images/box-info/box-info-tempura.jpg",
                    color: "blue",
                    cuisine: "日式料理",
                    price: "120",
                    time: "40分鐘",
                    tool: "炸鍋",
                    intro: "歡迎品味我們的經典炸蝦天婦羅，這是一道令人垂涎的日本料理，以其酥脆的外皮和鮮美的蝦肉而聞名，是日本料理中的經典之一，它結合了新鮮的蝦子、蔬菜和蓬鬆的麵糰，經過炸至金黃酥脆。",
                    ingredients: [
                        { item: "大蝦", num: "5隻" },
                        { item: "低筋麵粉", num: "150g" },
                        { item: "太白粉", num: "2勺" },
                        { item: "雞蛋", num: "1顆" },
                        { item: "鹽", num: "適量" },
                    ],
                    steps: [
                        { id: 1, title: "準備蝦", do: "將大蝦去殼，但保留尾巴。" },
                        { id: 2, title: "製作麵糊", do: "在一個碗中，將麵粉和冷水混合，直到麵糊變得均勻且稍微稀薄。確保不要過度攪拌，留下一些小的麵粉粒子。" },
                        { id: 3, title: "炸蝦", do: "蝦可以先沾上一層薄薄的麵粉，然後再沾上麵糊。把蝦小心地放入熱油中，炸約2至3分鐘，或直到它們變成金黃色和熟透。" },
                        { id: 4, title: "瀝乾和調味", do: "用紙巾或濾網將多餘的油瀝乾。灑上一些鹽，以調味炸好的蝦" },
                       
                       
                    ],
                    tip1: "盡量保持炸油的溫度穩定，這樣炸出的食物才會均勻上色和變得脆脆的。",
                    tip2: "避免一次性炸太多蔬菜或蝦，這樣可以確保它們不會黏在一起，且炸製更均勻。",
                    tip3: "在沾麵糊之前，確保蝦盡量乾燥，以防止麵糊不附著。",
                    chefName: "橫山一郎",
                    chefIntro: "橫山一郎是一位熱愛料理的資深日本料理大廚，擁有超過25年的廚藝經驗。他在年輕時就對料理產生濃厚的興趣，經過多年的學習與精進，成為了日本料理界的翹楚。橫山一郎對於傳統的日本料理深具造詣，同時也敢於嘗試創新，將傳統料理元素與現代烹飪技巧巧妙結合。",
                    chefImg: "./images/box-info/box-info-chef1.png"

                },
               
                {
                    id: 18,
                    name: "宮保雞丁",
                    img: "./images/box-info/box-info-kungpao.jpg",
                    cuisine: "中式料理",
                    price: "125",
                    time: "25分鐘",
                    tool: "平底鍋",
                    intro: "宮保雞丁是一道經典的川菜，以嫩雞肉丁、花生、辣椒和各種香料製成，呈現出多層次的風味。既可以作為主菜，搭配白飯或麵食，也可以作為下酒菜或家庭聚會的佳餚。",
                    ingredients: [
                        { item: "雞胸肉", num: "250g" },
                        { item: "花生", num: "1/2杯" },
                        { item: "乾紅辣椒", num: "2條" },
                        { item: "薑蒜末", num: "適量" },
                        { item: "醋、糖、醬油", num: "各2匙" },
                        { item: "米酒", num: "1匙" },
                        { item: "澱粉", num: "1匙" },
                        { item: "鹽和胡椒粉", num: "適量" },

                    ],
                    steps: [
                        { id: 1, title: "製作宮保醬汁", do: "在一個碗中混合醋、糖、醬油、料酒（如果使用）和水，攪拌均勻，製作宮保醬汁。" },
                        { id: 2, title: "準備雞肉", do: "在雞肉丁中加入澱粉，輕輕攪拌均勻，以幫助後續烹煮時保持多汁。" },
                        { id: 3, title: "炸花生", do: "在平底鍋中，加熱食用油。當油溫達到約180°C時，加入花生，炸約1-2分鐘，直到它們變得金黃酥脆。" },
                        { id: 4, title: "炒宮保雞丁", do: "在同一個平底鍋中，加入一些食用油，加熱後加入切碎的蒜和薑，辣椒以及雞肉丁翻炒，直到雞肉變色並熟透。" },
                        { id: 5, title: "倒入醬汁", do: "倒入製作好的宮保醬汁，攪拌均勻，讓它變得稍微黏稠。" },
                        { id: 6, title: "加入花生", do: "加入炸好的花生，繼續翻炒約1分鐘，使所有材料均勻混合。" },
                        { id: 7, title: "調味", do:"根據口味，添加鹽和胡椒粉進一步調味。"},

                    ],
                    tip1: "嘗試將雞肉切成均勻大小的丁，這樣它們在烹煮時可以均勻熟透。",
                    tip2: "花生在熟透後會繼續在鍋外繼續烹煮，因此當它們變成淡金色時即可取出，避免變得太過酥脆。",
                    tip3: "根據個人口味調整辣椒的用量。您可以增加或減少辣椒的數量，以達到您喜好的辣度。",
                    chefName: "張文豪",
                    chefIntro: "張文豪在多個知名中式餐廳和飯店的廚房中積累了豐富的烹飪經驗。他對中式料理的烹飪技巧和食材有著深刻的理解，同時又善於將傳統與現代相結合，創造出別具一格的美食。他的烹飪作品不僅味道美味，更帶著他對食物和文化的獨特理解，成為了中式料理界一個備受矚目的男廚師。",
                    chefImg: "./images/box-info/box-info-chef3.png"

                },
                {
                    id: 19,
                    name: "東坡肉",
                    img: "./images/box-info/box-info-dongpo.jpg",
                    cuisine: "中式料理",
                    price: "166",
                    time: "60分鐘",
                    tool: "燉煮鍋",
                    intro: "東坡肉的特點是肥肉和瘦肉相間，每一口都融合了醇厚的肉汁和香甜的醬汁。這道菜常常作為重要的家庭聚餐或節慶饗宴的招待之一，適合作為主菜，搭配白飯或饅頭，也可作為一道菜單中的特色菜品。",
                    ingredients: [
                        { item: "五花肉", num: "500g" },
                        { item: "米酒", num: "2匙" },
                        { item: "薑、蔥", num: "適量" },
                        { item: "糖", num: "100g" },
                        { item: "醬油", num: "2匙" },
                        { item: "鹽", num: "適量" },
                      

                    ],
                    steps: [
                        { id: 1, title: "處理五花肉", do: "將五花肉块在水中焯水，以去除多餘的血水和雜質。然後將五花肉块切成大塊，每塊約2到3厘米的厚度。" },
                        { id: 2, title: "煎五花肉", do: "在一個深鍋中，熱一些油，將五花肉块放入鍋中，用中小火煎至表面金黃。" },
                        { id: 3, title: "調製醬汁", do: "在另一個鍋中，將料酒、生薑片、蔥段、紅糖、黃酒和醬油加入水中，然後將其煮沸，繼而降至中小火。" },
                        { id: 4, title: "加入五花肉", do: "將煎過的五花肉块放入調好的醬汁中。" },
                        { id: 5, title: "燉煮", do: "將五花肉繼續以中小火悶煮約1小時，直到五花肉變得極其軟嫩，且醬汁減少為止。" },
                        { id: 6, title: "收汁", do: "如果醬汁仍然過多，可以將火收至高濃度，繼續烹煮以收汁，直到醬汁變濃稠為止。" },
                        { id: 7, title: "裝盤", do:"將烹煮完成的東坡肉块裝盤，擺放蔥段和生薑片於肉上。"},

                    ],
                    tip1: "選擇帶有一定肥肉的五花肉塊，這樣可以確保烹飪後的肉質更加軟嫩和多汁。",
                    tip2: "在煎五花肉塊時，可以先在切面劃幾道刀痕，這樣能更好地釋放肉的油脂，使表面更加香脆。",
                    tip3: "調整醬汁的味道非常重要。您可以根據個人口味添加一些糖、醬油、酒或香料。",
                    chefName: "張文豪",
                    chefIntro: "張文豪在多個知名中式餐廳和飯店的廚房中積累了豐富的烹飪經驗。他對中式料理的烹飪技巧和食材有著深刻的理解，同時又善於將傳統與現代相結合，創造出別具一格的美食。他的烹飪作品不僅味道美味，更帶著他對食物和文化的獨特理解，成為了中式料理界一個備受矚目的男廚師。",
                    chefImg: "./images/box-info/box-info-chef3.png"

                },
                {
                    id: 20,
                    name: "牛肉麵",
                    img: "./images/box-info/box-info-beefnoodle.jpg",
                    cuisine: "中式料理",
                    price: "150",
                    time: "50分鐘",
                    tool: "燉煮鍋",
                    intro: "這是一道融合了豐富口味和滋補營養的料理。以其獨特的牛肉湯底、嫩滑的牛肉片和香氣四溢的麵條而聞名。無論是在寒冷的冬季用來溫暖身體，還是在炎炎夏日享受清爽的口味，都是一道受歡迎的料理。",
                    ingredients: [
                        { item: "牛骨湯", num: "2升" },
                        { item: "牛腱肉或牛腩肉", num: "500g" },
                        { item: "薑蒜末", num: "適量" },
                        { item: "米酒", num: "1/4杯" },
                        { item: "糖", num: "1匙" },
                        { item: "麵條", num: "依喜好" },
                        { item: "青菜", num: "適量" }

                    ],
                    steps: [
                        { id: 1, title: "製作湯底", do: "在一個大湯鍋中，熱一些油，加入牛肉片，煮至變色。取出備用。" },
                        { id: 2, title: "加入辛香料", do: "在同一鍋中，加入料酒，然後加入薑片、大蒜、洋蔥，繼續煮至洋蔥變軟。" },
                        { id: 3, title: "加入湯底", do: "倒入牛骨湯或雞湯，再加入醬油、糖、魚露（如果使用）和胡椒粉。將湯煮沸，然後轉小火，繼續煮約2至3小時，直到湯底濃郁，牛肉變得軟嫩。" },
                        { id: 4, title: "烹煮配菜和牛肉", do: "當湯底熬煮時，可以將青菜煮熟，然後瀝乾。將煮熟的牛肉片放入湯底中，繼續煮約2至3分鐘，直到牛肉變得軟嫩。" },
                        { id: 5, title: "烹飪麵條", do: "當湯底和牛肉煮好時，煮麵條，根據包裝上的說明，直到熟透，然後瀝乾。" },
                        { id: 6, title: "組合碗裝", do: "在碗中放入熟麵條，加入湯底、牛肉和青菜即可完成" },
                        

                    ],
                    tip1: "選擇優質的牛腱肉或牛腩肉，這些部位較適合燉煮，能讓牛肉更加軟嫩。",
                    tip2: "煮湯底時，儘量保持低火並慢慢煮，以便湯底能夠充分濃縮風味。",
                    tip3: "牛肉麵是一道需要耐心的料理。慢煮能讓湯底和牛肉充分融合風味，創造出最美味的結果。",
                    chefName: "張文豪",
                    chefIntro: "張文豪在多個知名中式餐廳和飯店的廚房中積累了豐富的烹飪經驗。他對中式料理的烹飪技巧和食材有著深刻的理解，同時又善於將傳統與現代相結合，創造出別具一格的美食。他的烹飪作品不僅味道美味，更帶著他對食物和文化的獨特理解，成為了中式料理界一個備受矚目的男廚師。",
                    chefImg: "./images/box-info/box-info-chef3.png"

                },
                {
                    id: 21,
                    name: "番茄義大利麵",
                    img: "./images/box-info/box-info-spegatti.jpg",
                    color: "green",
                    cuisine: "西式料理",
                    price: "180",
                    time: "30分鐘",
                    tool: "平底鍋",
                    intro: "這是一道充滿意大利風情的經典美食，以其豐富的番茄醬汁、和煮熟的麵條而聞名。無論是作為主菜、麵食愛好者的首選，還是作為快捷而滿足的美食，番茄義大利麵都能讓您享受到烹飪的美妙。",
                    ingredients: [
                        { item: "義大利麵", num: "200g" },
                        { item: "豬絞肉", num: "200g" },
                        { item: "罐裝番茄醬", num: "400g" },
                        { item: "洋蔥", num: "1顆" },
                        { item: "蒜末", num: "2瓣" },
                        { item: "鹽和胡椒粉", num: "適量" }
                    ],
                    steps: [
                        { id: 1, title: "煮義大利麵", do: "根據包裝上的說明，在鹽水中煮熟義大利麵，瀝乾備用。" },
                        { id: 2, title: "炒煮絞肉", do: "在鍋中加熱一些橄欖油，加入豬絞肉，煎炒至肉變色，瀝油備用。" },
                        { id: 3, title: "炒煮洋蔥和蒜末", do: "在同一個鍋中，加入更多橄欖油，炒煮切碎的洋蔥和蒜末，炒至洋蔥變軟。" },
                        { id: 4, title: "加入番茄醬", do: "加入罐裝番茄醬，攪拌均勻，讓番茄醬和洋蔥混合在一起。" },
                        { id: 5, title: "加入煮肉", do: "將之前煮熟的豬絞肉加入番茄醬中，攪拌均勻，使肉和醬料結合。" },
                        { id: 6, title: "調味", do: "根據口味加入鹽、胡椒粉。讓醬料悶煮幾分鐘，使味道混合。" },
                        { id: 7, title: "混合義大利麵和醬料", do: "將煮熟的義大利麵倒入醬料中，輕輕攪拌，使麵條均勻覆蓋在醬料上。" },

                     
                        
                    ],
                    tip1: "如果您喜歡，可以使用新鮮的番茄，將其切碎後加入醬料中，使醬料更自然鮮甜。",
                    tip2: "加入一些紅酒可以增添醬料的豐富風味，但請確保烹飪過程中酒精已經揮發。",
                    tip3: "醬料的味道可以根據個人喜好進行微調，如果喜歡稍微甜一些的味道，可以添加一點糖。",
                    chefName: "Alex Hamilton",
                    chefIntro: "Alex Hamilton是一位傑出的西式料理男廚師，他以他的創意、專業和熱情在烹飪界引起了廣泛的關注。出生於法國的廚藝世家，亞歷克斯從小就對美食和烹飪技藝產生濃厚的興趣。他善於將新鮮的季節食材和當地的特色結合，呈現出充滿層次感和口感的菜品，總是能給食客帶來驚喜和滿足。",
                    chefImg: "./images/box-info/box-info-chef2.png"

                },

            ],
            currentTag:null, //初始狀態沒有元素被添加
            isToggled: false // 初始情况下不展开
        };
    },
    methods: {
        addNumber() {
            let buy_value = document.getElementsByClassName("buy-value")[0];
            let btn_add = document.getElementsByClassName('b-add')[0];
            if (buy_value.value < 30) {
                buy_value.value = parseInt(buy_value.value) + 1;
                // buy_value.value +=1;
            } else {
                window.alert("超過庫存數量")
            }

        },
        subNumber() {
            let btn_sub = document.getElementsByClassName('b-sub')[0];
            let buy_value = document.getElementsByClassName("buy-value")[0];
            if (buy_value.value >= 2) {
                buy_value.value -= 1;
            }


        },
        addCart() {
            let buy_value = document.getElementsByClassName("buy-value")[0];

            var productInfo = {
                img: this.product[this.index].img,
                name: this.product[this.index].name, // 替换为实际的产品信息
                price: this.product[this.index].price, // 替换为实际的产品价格
                quantity: buy_value.value,
                total: (this.product[this.index].price) * buy_value.value
                // 添加其他产品信息
            };

            // 获取购物车数据（如果存在）
            var cart = JSON.parse(localStorage.getItem('cart')) || [];


            // 检查购物车中是否已经存在相同的商品
            const existingItem = cart.find(cartItem => cartItem.name === productInfo.name);

            if (existingItem) {
                // 如果存在相同的商品，更新数量
                existingItem.quantity = parseInt(existingItem.quantity) + parseInt(productInfo.quantity);
                existingItem.total = existingItem.price * existingItem.quantity;
            } else {
                // 否则，将新商品添加到购物车
                cart.push(productInfo);
            }


            // 将购物车数据重新存储到 localStorage
            localStorage.setItem('cart', JSON.stringify(cart));
        },
        changeTag(tag) {
            // 当点击一个标签时，将该标签设置为当前标签，并取消其他标签的选择
            this.currentTag = tag;
          },
          toggleSlide() {
            this.isToggled = !this.isToggled;
          }
    },
    mounted() {
        let urlParams = new URLSearchParams(window.location.search);
        // console.log(urlParams.has('q')); // true
        // console.log(urlParams.get('id')); // "abc"
        // console.log(urlParams.getAll('action')); // ["abc"]
        // console.log(urlParams.toString()); // "q=1234&txt=abc"
        // console.log(urlParams.append('page', '1')); // "q=1234&txt=abc&page=1"
        this.index = urlParams.get('id') - 1;

        // console.log(this.index);
        // console.log(urlParams.get('tag'));

    }
});

app.mount("#app");